export const TEXT_CHARS =
  /^[А-Яа-яA-Za-zёЁіІ"'«»,|\.\-―–‒−—\:\s\\\(\)\d\/!\*×\~@#\$%\^&_\+=№;\?⁰¹²³⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ⁿ₀₁₂₃₄₅₆₇₈₉₊₋₌₍₎ₐₑₒₓₔⁱ⁄²³ᴬᴮᴰᴱᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾᴿᵀᵁⱽᵂᵃᵇᶜᵈᵉᶠᵍʰⁱʲᵏˡᵐⁿᵒᵖʳˢᵗᵘᵛʷˣʸᶻₐₑₕᵢⱼₖₗₘₙₒₚᵣₛₜᵤᵥₓᵋᵝᵞᵟᵠᵡᵦᵧᵨᵩᵪᶥᶿ±∅˚°º”‰″∆™>®Ø’℃…∙·ö=≈≠〈〉 ̅≡<>˃⩽⩾≪≫≥≤ααιαυβγγγγκγξγχδεειευζηθικλμνξοοιουπρσ,ςτυφχψωʽ∞Ö\]\[•◦÷“ΣµÜ‘]+$/;

export const NAME_CHARS = /^[А-Яа-яёЁіІA-Za-z\-]+$/;

export const URL_CHARS = /^(?![_\-])[a-zA-Z0-9_\-\.]*(?<![_\-])$/;

export const LOGIN_CHARS = /^[a-zA-Z0-9_\.]+$/;

export const ASCII_CHARS = /^[\x00-\x7F]+$/;

export const NUMERIC_CHARS = /^[0-9]+$/;
